Бухгалтерия_для_Казахстана_демо.ГрупповоеПерепроведениеПоРаписанию/src/DataProcessors/ГрупповоеПерепроведениеДокументов/ГрупповоеПерепроведениеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e6643852-2b29-4280-8c85-43901fdbd7d9">
  <name>ГрупповоеПерепроведениеДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

Бухгалтерия_для_Казахстана_демо.ГрупповоеПерепроведениеПоРаписанию/src/Enums/ГП_ПараметрыРегламентныхЗаданий/ГП_ПараметрыРегламентныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГП_ПараметрыРегламентныхЗаданий</name>
  <enumValues>
    <name>ТипыДокументов</name>
  </enumValues>
  <enumValues>
    <name>Организации</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачала</name>
  </enumValues>
  <enumValues>
    <name>ТекущийДокумент</name>
  </enumValues>
  <enumValues>
    <name>КоличествоМесяцевДляПерепроведения</name>
  </enumValues>
  <enumValues>
    <name>ПолучателиРассылки</name>
  </enumValues>
</mdclass:Enum>

Бухгалтерия_для_Казахстана_демо.ГрупповоеПерепроведениеПоРаписанию/src/DataProcessors/ГрупповоеПерепроведениеДокументов/Forms/Настройка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузитьПараметры();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
	Оповестить("Запись_ГП_ПараметрыРегламентныхЗаданий");
	ПоказатьОповещениеПользователя("Параметры сохранены");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьПараметры()
	Данные = РегистрыСведений.ГП_ПараметрыРегламентныхЗаданий.ПолучитьВсеПараметры();
	ЗагрузитьТипыДокументов(Данные);
	ЗагрузитьОрганизации(Данные);

	ЗначениеДаты = Данные.Получить(Перечисления.ГП_ПараметрыРегламентныхЗаданий.ДатаНачала);
	ДатаНачала = ?(ТипЗнч(ЗначениеДаты) = Тип("Дата"), ЗначениеДаты, НачалоМесяца(ТекущаяДатаСеанса()));

	ЗначениеМесяцев = Данные.Получить(Перечисления.ГП_ПараметрыРегламентныхЗаданий.КоличествоМесяцевДляПерепроведения);
	КоличествоМесяцевДляПерепроведения = ?(ТипЗнч(ЗначениеМесяцев) = Тип("Число"), ЗначениеМесяцев, 1);

	ЗначениеРассылки = Данные.Получить(Перечисления.ГП_ПараметрыРегламентныхЗаданий.ПолучателиРассылки);
	ПолучателиРассылки = ?(ТипЗнч(ЗначениеРассылки) = Тип("Строка"), ЗначениеРассылки, "");
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТипыДокументов(Данные)
	МассивТиповДокументов = Данные.Получить(Перечисления.ГП_ПараметрыРегламентныхЗаданий.ТипыДокументов);
	ТипыДокументов.Очистить();
	ТипыДокументов.ТипЗначения = Новый ОписаниеТипов("Тип");
	Элементы.ТипыДокументов.СписокВыбора.ЗагрузитьЗначения(ГП_ОбщийМодуль.ПолучитьОграничениеТипаПроводимыхДокументов());
	Если ТипЗнч(МассивТиповДокументов) = Тип("Массив") Тогда
		Для Каждого ТипДокумента Из МассивТиповДокументов Цикл
			Если Метаданные.НайтиПоТипу(ТипДокумента) <> Неопределено Тогда
				ТипыДокументов.Добавить(ТипДокумента);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОрганизации(Данные)
	МассивОрганизаций = Данные.Получить(Перечисления.ГП_ПараметрыРегламентныхЗаданий.Организации);
	Организации.Очистить();
	Организации.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Организации");
	Если ТипЗнч(МассивОрганизаций) = Тип("Массив") Тогда
		Для Каждого Организация Из МассивОрганизаций Цикл
			Если ОбщегоНазначения.СсылкаСуществует(Организация) Тогда
				Организации.Добавить(Организация);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	ПараметрыДляЗаписи = Новый Соответствие;
	ПараметрыДляЗаписи.Вставить(Перечисления.ГП_ПараметрыРегламентныхЗаданий.ТипыДокументов, ТипыДокументов.ВыгрузитьЗначения());
	ПараметрыДляЗаписи.Вставить(Перечисления.ГП_ПараметрыРегламентныхЗаданий.Организации, Организации.ВыгрузитьЗначения());
	ПараметрыДляЗаписи.Вставить(Перечисления.ГП_ПараметрыРегламентныхЗаданий.ДатаНачала, ДатаНачала);
	ПараметрыДляЗаписи.Вставить(Перечисления.ГП_ПараметрыРегламентныхЗаданий.КоличествоМесяцевДляПерепроведения, КоличествоМесяцевДляПерепроведения);
	ПараметрыДляЗаписи.Вставить(Перечисления.ГП_ПараметрыРегламентныхЗаданий.ПолучателиРассылки, ПолучателиРассылки);
	ГП_ОбщийМодуль.СохранитьПараметрыРегламентныхЗаданий(ПараметрыДляЗаписи);
КонецПроцедуры

#КонецОбласти
